frontend/controllers/IssueInventoryController.php

    public function actionCreate()
    {
        $user_id = \Yii::$app->user->identity->id;

        $model = new IssueInventory();
        $model->loadDefaultValues();
        $model->create_user_id = $user_id;
        $model->issue_date = date('Y-m-d');
        $model->create_date = date('Y-m-d');

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `issue_inventory` (`record_status`, `create_user_id`, `issue_date`, `create_date`, `vehicle_id`) VALUES ('active', 1, '2016-11-01', '2016-11-01', 634)

    protected function findModel($id)
    {
        if (($model = IssueInventory::findOne($id)) !== null) {
---
SELECT * FROM `issue_inventory` WHERE `issue_inventory_id`='8'