frontend/controllers/PurchaseOrderController.php

SELECT * FROM `purchase_order` WHERE `purchase_order_id`='14'
---
    protected function findModel($id)
    {
        if (($model = PurchaseOrder::findOne($id)) !== null) {