frontend/models/Sales.php

SELECT * FROM `sales_person` WHERE `record_status`='active'
---
    public function getSalesPersonList() { // could be a static func as well
        $models = SalesPerson::find()->where(['record_status'=>'active'])->asArray()->all();

SELECT * FROM `vehicle` WHERE `vehicle_id`=231
---
    public function getReferenceNumber($id) { // could be a static func as well
        $models = Vehicle::find()->where(['vehicle_id'=>$id])->asArray()->all();

SELECT * FROM `customer` WHERE `record_status`='active'
---
    public function getCustomerList() { // could be a static func as well
        $models = Customer::find()->where(['record_status'=>'active'])->asArray()->all();